English/SSLD/2-3 2.11 Spontaneity.org
#+OPTIONS: \n:t toc:nil num:nil html-postamble:nil
#+HTML_HEAD_EXTRA: <style>body {background: rgb(193, 230, 198) !important;}</style>
* 2-3 2.11 Spontaneity
#+begin_verse
Right, so what I'm hearing is sort of on the individual level
		we have these patterns of attachment from early life that kind of follow us,
	and then on a broader level, there's these social scripts that we also follow.
But then, everything sounds predetermined,
	so where's that spontaneity or like following your heart?
Is there still a place for that? 

Well, I would say, yes, of course.
Because life would be like too boring without those.
What we would use as an analogy is,
	say for example, you're up for some fun moments like playing hockey or skiing.
What we are saying is
	that you have to learn the basic skills
		and then you also have to equip yourself with the right gear
			that fits your body, your size and your needs,
		and then you can go in and have fun.
Then you can ski, and have fun, and be spontaneous, and follow your heart.
But if you do not do that,
		and you just jump in without paying attention to these details,
	there's a huge chance that you would first not have fun and then,
		there is a very real possibility that you can get severely hurt.
So that I think it's an analogy that you use. 

Back to the relationship situation,
	our thinking is if you have spent some time reflecting on yourself,
			understanding your own needs and circumstances, characteristics, and capacity
		and you know what you're looking for in the relationship.
And you have sort of learned the basic skills
		for like communicating, interacting, building relationships,
	you will actually be more capable to get into situations where you can be spontaneous.
Because you can then trust yourself,
	like I can just sit down and relax and have a conversation and I know it will turn out well.
So that is the kind of self-efficacy or sense of ease that we want to establish in people
	so that they can really be going in there slow and enjoy the relationship.
#+end_verse
** expression
attachment [əˈtætʃmənt]: n. a feeling that you like or love someone or something and that you would be unhappy without them依恋
script [skrɪpt]: n. the written form of a speech, play, film etc ⇨ screenplay手稿, 手迹, 剧本
predetermined [ˌpridɪˈtɜrmɪnd]: adj. decided or arranged before something happens, so that it does not happen by chance预定的
analogy [əˈnælədʒi]: n. something that seems similar between two situations, processes etc类比
hockey [ˈhɒki]: n. a gplayed on grass by two teams of 11 players, with sticks and a ball SYN field hockey American English曲棍球
gear [ɡɪr]: n. the machinery in a vehicle such as a car, truck, or bicycle that you use to go comfortably at different speeds齿轮, 传动装置
capacity [kəˈpæsəti]: n. someone’s ability to do something OPP incapacity才能, 能力
efficacy [ˈefɪkəsi]: n. formal the ability of something to produce the right result SYN effectiveness OPP inefficacy功效, 效验
--------------------
on the individual level: 在个人层面上
on a broader level: 在更广泛的层面上
follow sb's heart: 跟随内心
say for example: 比如说
be up for sth./doing sth.: 准备好某事/做某事
go in (sth./doing sth.): 参加某事/做某事
jump in/into sth./doing sth.: 突然投入某事
there is a very real possibility that: 很有可能+...
be capable to do sth.: 有能力做某事
