SSLD/2-3 2.11 Spontaneity.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-11-27 Wed 16:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="DESKTOP-13B7HQM" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-orga37cb6d" class="outline-2">
<h2 id="orga37cb6d">2-3 2.11 Spontaneity</h2>
<div class="outline-text-2" id="text-orga37cb6d">
<p class="verse">
Right, so what I'm hearing is sort of on the individual level<br />
&#xa0;&#xa0;we have these patterns of attachment from early life that kind of follow us,<br />
&#xa0;and then on a broader level, there's these social scripts that we also follow.<br />
But then, everything sounds predetermined,<br />
&#xa0;so where's that spontaneity or like following your heart?<br />
Is there still a place for that?<br />
<br />
Well, I would say, yes, of course.<br />
Because life would be like too boring without those.<br />
What we would use as an analogy is,<br />
&#xa0;say for example, you're up for some fun moments like playing hockey or skiing.<br />
What we are saying is<br />
&#xa0;that you have to learn the basic skills<br />
&#xa0;&#xa0;and then you also have to equip yourself with the right gear<br />
&#xa0;&#xa0;&#xa0;that fits your body, your size and your needs,<br />
&#xa0;&#xa0;and then you can go in and have fun.<br />
Then you can ski, and have fun, and be spontaneous, and follow your heart.<br />
But if you do not do that,<br />
&#xa0;&#xa0;and you just jump in without paying attention to these details,<br />
&#xa0;there's a huge chance that you would first not have fun and then,<br />
&#xa0;&#xa0;there is a very real possibility that you can get severely hurt.<br />
So that I think it's an analogy that you use.<br />
<br />
Back to the relationship situation,<br />
&#xa0;our thinking is if you have spent some time reflecting on yourself,<br />
&#xa0;&#xa0;&#xa0;understanding your own needs and circumstances, characteristics, and capacity<br />
&#xa0;&#xa0;and you know what you're looking for in the relationship.<br />
And you have sort of learned the basic skills<br />
&#xa0;&#xa0;for like communicating, interacting, building relationships,<br />
&#xa0;you will actually be more capable to get into situations where you can be spontaneous.<br />
Because you can then trust yourself,<br />
&#xa0;like I can just sit down and relax and have a conversation and I know it will turn out well.<br />
So that is the kind of self-efficacy or sense of ease that we want to establish in people<br />
&#xa0;so that they can really be going in there slow and enjoy the relationship.<br />
</p>
</div>
