English/SSLD/2-3 2.11 Spontaneity.org
** sentence
attachment [əˈtætʃmənt]: n. a feeling that you like or love someone or something and that you would be unhappy without them依恋
- A child's attachment to his mother is the first step in building a good relationship. 
- The breakdown of his attachment to his father causes him to seek truth.
- His attachment to his father led him to find his long-last father.
script [skrɪpt]: n. the written form of a speech, play, film etc ⇨ screenplay手稿, 手迹, 剧本
- I still need to download scripts to understand videos in English.
- As the script put it: he is not a bastard, but the true heir to the Iron Throne.
- With script stolen by hackers, scriptwriter has to write a new ending.
predetermined [ˌpridɪˈtɜrmɪnd]: adj. decided or arranged before something happens, so that it does not happen by chance预定的
- No one could account for the fact that the fate of roles in the play are all predetermined.
- If all were predetermined, we could do nothing to change our fate.
- It seems to be predeterminded that the traitor would be killed by the girl whose family had been murdered at the wedding.
analogy [əˈnælədʒi]: n. something that seems similar between two situations, processes etc类比
- It's not exactly what I said, it's only an analogy.
- It's just an analogy, not because of who has said that, but because of what it is.
- It occurred to a butcher to make an analogy in the speech.
hockey [ˈhɒki]: n. a gplayed on grass by two teams of 11 players, with sticks and a ball SYN field hockey American English曲棍球
- He is a friend who used to invite me to play hockey in his house.
- Shame of being beaten in a hockey competition, he refused to play it in public.
- When we played hockey, our cat appeared and chased the ball.
gear [ɡɪr]: n. the machinery in a vehicle such as a car, truck, or bicycle that you use to go comfortably at different speeds齿轮, 传动装置,档
- When your car goes uphill, you'd better have it in second gear.
- In second gear, our car never reached a speed of 40 kilometers an hour.
- If your car keep in second gear, we must be late for taking part in the sail competition.
capacity [kəˈpæsəti]: n. someone’s ability to do something OPP incapacity才能, 能力
- Fortunately, his uncle admired his capacity for League of Legend and offered him money to pursue his game career.
- In his youth, his capacity for box emerged and was chosen by a prominent boxer.
- His capacity for box lets him enjoy tremendous popularity.
efficacy [ˈefɪkəsi]: n. formal the ability of something to produce the right result SYN effectiveness OPP inefficacy功效, 效验
- This kind of treatment has been eliminated, not because it lacks efficacy, but because of heavy side effects. 
- Its efficacy has already been proved during the plague.
- His death reminds me of the efficacy of a special kind of herb in the plain.
--------------------
on the individual level: 在个人层面上
- External event I cannot control, but I must plan out our march to the last detail on the individual level.
- On the individual level, he was never meant to be a good father.
- On the individual level, he was blessed with the capacity for war and politics.
on a broader level: 在更广泛的层面上
- On a broader level, he devoted himself to the country and his people.
- On a broader level, he never has enough time to spend with his child.
- On a broader level, the rate of abortion in teenagers is declining. 
follow sb's heart: 跟随内心
- When I hesitated to go to the jewelry shop, there is a voice telling me 'follow your heart'.
- Follow your heart and you will find the best path to the outlet.
- Follow your heart and ask yourself whether you will be put out of business or not.
say for example: 比如说
- Say for example, you lose your temper when an official fines you 50 yuan for spitting in public.
- Say for example, you fight yourself against bully taking your heart.
- Say for example, while you were working hard, your wife was cheating with her lover in your bed.
be up for sth./doing sth.: 准备好某事/做某事
- Are you up for an adventure in other land?
- The scriptwriter is up for bring a happy end to the series.
- The heroine, a dear noble lady who had always been so kind to everybody, was up for her revenge.
go in (sth./doing sth.): 参加某事/做某事
- If you don't prepare chopsticks and bowls, how can we go in our dinner?
- Going in our activity, he forgot all awful memeories about his family.
- I am not up for going in dinner with a hateful queen.
jump in/into sth./doing sth.: 突然投入某事
- Not equiped with weapons, he jumped in the fight and was killed by mistake.
- The cat jumped into having breakfast.
- If you jump in the competition, there's a very real possibility that you will be killed in action.
there is a very real possibility that: 很有可能+...
- There is a very real possibility that the kind gets mad because you keep assailing him.
- There is a very real possibility that our princess, a lovely girl who is admired by her people, is still a virgin.
- There is a very real possibility that the night watch will march the north before winter comes.
be capable to do sth.: 有能力做某事
- He is capable to seize power in the captal when we start a war in the north.
- He is capable to convert our king to the Protestant.
- Our king is capable to rule the seven kingdom again with his 70,000 cavalrymen.
