SSLD/2-3 2.11 Spontaneity.html
<div id="outline-container-org7ae794d" class="outline-3">
<h3 id="org7ae794d">expression</h3>
<div class="outline-text-3" id="text-org7ae794d">
<p>
attachment [əˈtætʃmənt]: n. a feeling that you like or love someone or something and that you would be unhappy without them依恋<br />
script [skrɪpt]: n. the written form of a speech, play, film etc ⇨ screenplay手稿, 手迹, 剧本<br />
predetermined [ˌpridɪˈtɜrmɪnd]: adj. decided or arranged before something happens, so that it does not happen by chance预定的<br />
analogy [əˈnælədʒi]: n. something that seems similar between two situations, processes etc类比<br />
hockey [ˈhɒki]: n. a gplayed on grass by two teams of 11 players, with sticks and a ball SYN field hockey American English曲棍球<br />
gear [ɡɪr]: n. the machinery in a vehicle such as a car, truck, or bicycle that you use to go comfortably at different speeds齿轮, 传动装置<br />
capacity [kəˈpæsəti]: n. someone’s ability to do something OPP incapacity才能, 能力<br />
efficacy [ˈefɪkəsi]: n. formal the ability of something to produce the right result SYN effectiveness OPP inefficacy功效, 效验<br />
</p>
<hr />
<p>
on the individual level: 在个人层面上<br />
on a broader level: 在更广泛的层面上<br />
follow sb's heart: 跟随内心<br />
say for example: 比如说<br />
be up for sth./doing sth.: 准备好某事/做某事<br />
go in (sth./doing sth.): 参加某事/做某事<br />
jump in/into sth./doing sth.: 突然投入某事<br />
there is a very real possibility that: 很有可能+&#x2026;<br />
be capable to do sth.: 有能力做某事<br />
</p>
</div>
</div>
<div id="outline-container-orgb532a79" class="outline-3">
<h3 id="orgb532a79">sentence</h3>
<div class="outline-text-3" id="text-orgb532a79">
<p>
attachment [əˈtætʃmənt]: n. a feeling that you like or love someone or something and that you would be unhappy without them依恋<br />
</p>
<ul class="org-ul">
<li>A child's attachment to his mother is the first step in building a good relationship.<br /></li>
<li>The breakdown of his attachment to his father causes him to seek truth.<br /></li>
<li>His attachment to his father led him to find his long-last father.<br /></li>
</ul>
<p>
script [skrɪpt]: n. the written form of a speech, play, film etc ⇨ screenplay手稿, 手迹, 剧本<br />
</p>
<ul class="org-ul">
<li>I still need to download scripts to understand videos in English.<br /></li>
<li>As the script put it: he is not a bastard, but the true heir to the Iron Throne.<br /></li>
<li>With script stolen by hackers, scriptwriter has to write a new ending.<br /></li>
</ul>
<p>
predetermined [ˌpridɪˈtɜrmɪnd]: adj. decided or arranged before something happens, so that it does not happen by chance预定的<br />
</p>
<ul class="org-ul">
<li>No one could account for the fact that the fate of roles in the play are all predetermined.<br /></li>
<li>If all were predetermined, we could do nothing to change our fate.<br /></li>
<li>It seems to be predeterminded that the traitor would be killed by the girl whose family had been murdered at the wedding.<br /></li>
</ul>
<p>
analogy [əˈnælədʒi]: n. something that seems similar between two situations, processes etc类比<br />
</p>
<ul class="org-ul">
<li>It's not exactly what I said, it's only an analogy.<br /></li>
<li>It's just an analogy, not because of who has said that, but because of what it is.<br /></li>
<li>It occurred to a butcher to make an analogy in the speech.<br /></li>
</ul>
<p>
hockey [ˈhɒki]: n. a gplayed on grass by two teams of 11 players, with sticks and a ball SYN field hockey American English曲棍球<br />
</p>
<ul class="org-ul">
<li>He is a friend who used to invite me to play hockey in his house.<br /></li>
<li>Shame of being beaten in a hockey competition, he refused to play it in public.<br /></li>
<li>When we played hockey, our cat appeared and chased the ball.<br /></li>
</ul>
<p>
gear [ɡɪr]: n. the machinery in a vehicle such as a car, truck, or bicycle that you use to go comfortably at different speeds齿轮, 传动装置,档<br />
</p>
<ul class="org-ul">
<li>When your car goes uphill, you'd better have it in second gear.<br /></li>
<li>In second gear, our car never reached a speed of 40 kilometers an hour.<br /></li>
<li>If your car keep in second gear, we must be late for taking part in the sail competition.<br /></li>
</ul>
<p>
capacity [kəˈpæsəti]: n. someone’s ability to do something OPP incapacity才能, 能力<br />
</p>
<ul class="org-ul">
<li>Fortunately, his uncle admired his capacity for League of Legend and offered him money to pursue his game career.<br /></li>
<li>In his youth, his capacity for box emerged and was chosen by a prominent boxer.<br /></li>
<li>His capacity for box lets him enjoy tremendous popularity.<br /></li>
</ul>
<p>
efficacy [ˈefɪkəsi]: n. formal the ability of something to produce the right result SYN effectiveness OPP inefficacy功效, 效验<br />
</p>
<ul class="org-ul">
<li>This kind of treatment has been eliminated, not because it lacks efficacy, but because of heavy side effects.<br /></li>
<li>Its efficacy has already been proved during the plague.<br /></li>
<li>His death reminds me of the efficacy of a special kind of herb in the plain.<br /></li>
</ul>
<hr />
<p>
on the individual level: 在个人层面上<br />
</p>
<ul class="org-ul">
<li>External event I cannot control, but I must plan out our march to the last detail on the individual level.<br /></li>
<li>On the individual level, he was never meant to be a good father.<br /></li>
<li>On the individual level, he was blessed with the capacity for war and politics.<br /></li>
</ul>
<p>
on a broader level: 在更广泛的层面上<br />
</p>
<ul class="org-ul">
<li>On a broader level, he devoted himself to the country and his people.<br /></li>
<li>On a broader level, he never has enough time to spend with his child.<br /></li>
<li>On a broader level, the rate of abortion in teenagers is declining.<br /></li>
</ul>
<p>
follow sb's heart: 跟随内心<br />
</p>
<ul class="org-ul">
<li>When I hesitated to go to the jewelry shop, there is a voice telling me 'follow your heart'.<br /></li>
<li>Follow your heart and you will find the best path to the outlet.<br /></li>
<li>Follow your heart and ask yourself whether you will be put out of business or not.<br /></li>
</ul>
<p>
say for example: 比如说<br />
</p>
<ul class="org-ul">
<li>Say for example, you lose your temper when an official fines you 50 yuan for spitting in public.<br /></li>
<li>Say for example, you fight yourself against bully taking your heart.<br /></li>
<li>Say for example, while you were working hard, your wife was cheating with her lover in your bed.<br /></li>
</ul>
<p>
be up for sth./doing sth.: 准备好某事/做某事<br />
</p>
<ul class="org-ul">
<li>Are you up for an adventure in other land?<br /></li>
<li>The scriptwriter is up for bring a happy end to the series.<br /></li>
<li>The heroine, a dear noble lady who had always been so kind to everybody, was up for her revenge.<br /></li>
</ul>
<p>
go in (sth./doing sth.): 参加某事/做某事<br />
</p>
<ul class="org-ul">
<li>If you don't prepare chopsticks and bowls, how can we go in our dinner?<br /></li>
<li>Going in our activity, he forgot all awful memeories about his family.<br /></li>
<li>I am not up for going in dinner with a hateful queen.<br /></li>
</ul>
<p>
jump in/into sth./doing sth.: 突然投入某事<br />
</p>
<ul class="org-ul">
<li>Not equiped with weapons, he jumped in the fight and was killed by mistake.<br /></li>
<li>The cat jumped into having breakfast.<br /></li>
<li>If you jump in the competition, there's a very real possibility that you will be killed in action.<br /></li>
</ul>
<p>
there is a very real possibility that: 很有可能+&#x2026;<br />
</p>
<ul class="org-ul">
<li>There is a very real possibility that the kind gets mad because you keep assailing him.<br /></li>
<li>There is a very real possibility that our princess, a lovely girl who is admired by her people, is still a virgin.<br /></li>
<li>There is a very real possibility that the night watch will march the north before winter comes.<br /></li>
</ul>
<p>
be capable to do sth.: 有能力做某事<br />
</p>
<ul class="org-ul">
<li>He is capable to seize power in the captal when we start a war in the north.<br /></li>
<li>He is capable to convert our king to the Protestant.<br /></li>
<li>Our king is capable to rule the seven kingdom again with his 70,000 cavalrymen.<br /></li>
</ul>
</div>
</div>
