English/SSLD/2-3 2.11 Spontaneity.org
** summary2
On the individual level, we have patterns of attachment from early life,
	and on a broader level, there are social scripts that we also follow.
Is there still a place for spontaneity or following your heart?
Yes, of course.
For example, you're up for playing hockey or skiing.
You have to learn the basic skills and equip yourself with the right gear
	so that you can go in, be spontaneous, and follow your heart.
However, if you just jump in without paying attention to these details,
	there's a very real possibility that you would not have fun and get severely hurt.
Back to the relationship situation,
	if you have spent some time reflecting on yourself,
		 figuring out your own needs, characteristics, and capacity,
		and you know what you are looking for in the relationship,
		and you learned basic skills, like communicating, interacting, and building relationships,
		you will be more capable to enjoy the relationship and be spontaneous. 
