SSLD/2-3 2.11 Spontaneity.html
<div id="outline-container-orgda3d00a" class="outline-3">
<h3 id="orgda3d00a">summary2</h3>
<div class="outline-text-3" id="text-orgda3d00a">
<p>
On the individual level, we have patterns of attachment from early life,<br />
	and on a broader level, there are social scripts that we also follow.<br />
Is there still a place for spontaneity or following your heart?<br />
Yes, of course.<br />
For example, you're up for playing hockey or skiing.<br />
You have to learn the basic skills and equip yourself with the right gear<br />
	so that you can go in, be spontaneous, and follow your heart.<br />
However, if you just jump in without paying attention to these details,<br />
	there's a very real possibility that you would not have fun and get severely hurt.<br />
Back to the relationship situation,<br />
	if you have spent some time reflecting on yourself,<br />
		 figuring out your own needs, characteristics, and capacity,<br />
		and you know what you are looking for in the relationship,<br />
		and you learned basic skills, like communicating, interacting, and building relationships,<br />
		you will be more capable to enjoy the relationship and be spontaneous.<br />
</p>
</div>
</div>
</div>
</div>
</body>
</html>
